In [1]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:password@localhost:3306/

In [3]:
%%sql
CREATE TABLE course (
    course_id INT PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    trainer VARCHAR(50) NOT NULL
);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [4]:
%%sql
INSERT INTO course (course_id, name, trainer) VALUES
(1, 'Computer Science', 'Dr. Smith'),
(2, 'Mathematics', 'Prof. Johnson'),
(3, 'Physics', 'Dr. Brown'),
(4, 'Chemistry', 'Dr. White'),
(5, 'Biology', 'Prof. Green');

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[]

In [5]:
%%sql
CREATE TABLE student (
    id INT PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    address VARCHAR(100),
    course_id INT,
    age INT,
    fees DECIMAL(10, 2),
    FOREIGN KEY (course_id) REFERENCES course(course_id)
);
INSERT INTO student (id, name, address, course_id, age, fees) VALUES
(1, 'Alice', '123 Maple St.', 1, 20, 1500.00),
(2, 'Bob', '456 Oak St.', 2, 22, 1200.00),
(3, 'Charlie', '789 Pine St.', 3, 21, 1300.00),
(4, 'David', '321 Elm St.', 4, 23, 1400.00),
(5, 'Eva', '654 Cedar St.', 5, 19, 1100.00),
(6, 'Frank', '987 Birch St.', 1, 20, 1500.00),
(7, 'Grace', '135 Maple St.', 2, 22, 1200.00),
(8, 'Henry', '246 Oak St.', 3, 21, 1300.00),
(9, 'Irene', '369 Pine St.', 4, 23, 1400.00),
(10, 'Jack', '147 Elm St.', 5, 19, 1100.00),
(11, 'Alice', '123 Maple St.', 2, 20, 1500.00),  -- Additional enrollment for Alice
(12, 'Alice', '123 Maple St.', 3, 20, 1500.00),  -- Additional enrollment for Alice
(13, 'Bob', '456 Oak St.', 4, 22, 1200.00),      -- Additional enrollment for Bob
(14, 'Bob', '456 Oak St.', 5, 22, 1200.00),      -- Additional enrollment for Bob
(15, 'Charlie', '789 Pine St.', 4, 21, 1300.00), -- Additional enrollment for Charlie
(16, 'Charlie', '789 Pine St.', 5, 21, 1300.00); -- Additional enrollment for Charlie

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
16 rows affected.

[]

In [6]:
%%sql
select * from student;

 * mysql+pymysql://root:***@localhost:3306/
16 rows affected.

[(1, 'Alice', '123 Maple St.', 1, 20, Decimal('1500.00')),
 (2, 'Bob', '456 Oak St.', 2, 22, Decimal('1200.00')),
 (3, 'Charlie', '789 Pine St.', 3, 21, Decimal('1300.00')),
 (4, 'David', '321 Elm St.', 4, 23, Decimal('1400.00')),
 (5, 'Eva', '654 Cedar St.', 5, 19, Decimal('1100.00')),
 (6, 'Frank', '987 Birch St.', 1, 20, Decimal('1500.00')),
 (7, 'Grace', '135 Maple St.', 2, 22, Decimal('1200.00')),
 (8, 'Henry', '246 Oak St.', 3, 21, Decimal('1300.00')),
 (9, 'Irene', '369 Pine St.', 4, 23, Decimal('1400.00')),
 (10, 'Jack', '147 Elm St.', 5, 19, Decimal('1100.00')),
 (11, 'Alice', '123 Maple St.', 2, 20, Decimal('1500.00')),
 (12, 'Alice', '123 Maple St.', 3, 20, Decimal('1500.00')),
 (13, 'Bob', '456 Oak St.', 4, 22, Decimal('1200.00')),
 (14, 'Bob', '456 Oak St.', 5, 22, Decimal('1200.00')),
 (15, 'Charlie', '789 Pine St.', 4, 21, Decimal('1300.00')),
 (16, 'Charlie', '789 Pine St.', 5, 21, Decimal('1300.00'))]

In [7]:
%%sql
select * from course;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 'Computer Science', 'Dr. Smith'),
 (2, 'Mathematics', 'Prof. Johnson'),
 (3, 'Physics', 'Dr. Brown'),
 (4, 'Chemistry', 'Dr. White'),
 (5, 'Biology', 'Prof. Green')]

1. Total fees collected for each courses
2. Total fees for each course for student age above 21
3. Trainer name course name for student david
4.

In [18]:
%%sql
SELECT
    c.name AS course,
    SUM(s.fees) AS t_fees
FROM
    student s JOIN course c ON s.course_id = c.course_id
GROUP BY
    c.name;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[('Computer Science', Decimal('3000.00')),
 ('Mathematics', Decimal('3900.00')),
 ('Physics', Decimal('4100.00')),
 ('Chemistry', Decimal('5300.00')),
 ('Biology', Decimal('4700.00'))]

In [17]:
%%sql
SELECT 
    c.name AS course,
    sum(s.fees) AS t_fees
FROM
    student s JOIN course c ON c.course_id=s.course_id
WHERE
    s.age>21
GROUP BY
    c.name;

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[('Mathematics', Decimal('2400.00')),
 ('Chemistry', Decimal('4000.00')),
 ('Biology', Decimal('1200.00'))]

In [19]:
%%sql
SELECT 
    c.name AS course,
    c.trainer
FROM 
    student s JOIN course c ON s.course_id = c.course_id
WHERE 
    s.name LIKE 'david';

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Chemistry', 'Dr. White')]

1. Which course collecting fees 1500
2. How many students studying each trainer
3. Age of the students who are studying mathematics

In [36]:
%%sql
SELECT
    DISTINCT c.name AS course
FROM
    student s JOIN course c ON s.course_id = c.course_id
WHERE
    s.fees = 1500;

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[('Computer Science',), ('Mathematics',), ('Physics',)]

In [33]:
%%sql
SELECT 
    c.trainer,
    count(*) AS nums
FROM
    student s JOIN course c ON s.course_id = c.course_id
GROUP BY
    c.trainer;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[('Dr. Smith', 2),
 ('Prof. Johnson', 3),
 ('Dr. Brown', 3),
 ('Dr. White', 4),
 ('Prof. Green', 4)]

In [37]:
%%sql
SELECT
    s.name AS student,
    s.age
FROM 
    student s JOIN course c ON s.course_id = c.course_id
WHERE 
    c.name LIKE 'mathematics';

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[('Bob', 22), ('Grace', 22), ('Alice', 20)]

1. Course name which collecting highest amount of total fees
2. Which trainer teaching the highest number of students
3. Which courses are collecting between 1100 to 1300

In [39]:
%%sql
SELECT
    c.name AS course
FROM 
    student s JOIN course c ON s.course_id = c.course_id
GROUP BY
    c.name
ORDER BY
    SUM(s.fees) DESC
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Chemistry',)]

In [40]:
%%sql
SELECT
    c.trainer
FROM 
    student s JOIN course c ON s.course_id = c.course_id
GROUP BY
    c.trainer
ORDER BY 
    COUNT(*) DESC
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Dr. White',)]

In [42]:
%%sql
SELECT 
    DISTINCT c.name AS course
FROM 
    student s JOIN course c ON s.course_id = c.course_id
WHERE 
    s.fees BETWEEN 1100 AND 1300;

 * mysql+pymysql://root:***@localhost:3306/
4 rows affected.

[('Mathematics',), ('Physics',), ('Biology',), ('Chemistry',)]

1. Total qty soldout for each product name
2. Total sales for each customer name
3. Cust name,email,address who purchace qty 3
4. Sales date for product smartphone
5. Total qty soldout for prod price 400
6. Which prod soldout hightest in qty
7. Which prod soldout hightest in total qty
8. Which cust bought prod on sale date 2024-01-19
9. Total sales for each cust name for qty greater than 1 and total sales greater than 500
10. Total qty purchaced by customer email 'bob.smith@example.com'
11. Qty purchase by customer whos name starts with 'c'
12. Prod name which sales range from 150 to 500
13. Which customer bought highest qty of product
14. Order id for qty 1 and  2

In [46]:
%%sql
CREATE TABLE Customers (
    Customer_id INT PRIMARY KEY,
    name VARCHAR(100),
    email VARCHAR(100),
    address VARCHAR(255)
);
CREATE TABLE Products (
    Product_id INT PRIMARY KEY,
    name VARCHAR(100),
    price DECIMAL(10, 2)
);
create table Sales(order_id int not null,customer_id int not null,product_id int not null,sales_date date,quantity int not null , total int not null, foreign key (Customer_id) references customers(Customer_id),foreign key(product_id)
 references products(product_id));

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'INSERT INTO Products (product_id,name, price) VALUES\n(201,'Laptop', 1200.00),\n(2' at line 8")
[SQL: INSERT INTO Customers (customer_id,name, email, address) VALUES
(101,'Alice Johnson', 'alice.johnson@example.com', '123 Maple St.'),
(102,'Bob Smith', 'bob.smith@example.com', '456 Oak St.'),
(103,'Charlie Brown', 'charlie.brown@example.com', '789 Pine St.'),
(104,'David Wilson', 'david.wilson@example.com', '321 Elm St.'),
(105,'Eva Green', 'eva.green@example.com', '654 Cedar St.')

INSERT INTO Products (product_id,name, price) VALUES
(201,'Laptop', 1200.00),
(202,'Smartphone', 800.00),
(203,'Tablet', 400.00),
(204,'Headphones', 150.00),
(205,'Smartwatch', 250.00);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [47]:
%%sql
INSERT INTO Customers (customer_id,name, email, address) VALUES
(101,'Alice Johnson', 'alice.johnson@example.com', '123 Maple St.'),
(102,'Bob Smith', 'bob.smith@example.com', '456 Oak St.'),
(103,'Charlie Brown', 'charlie.brown@example.com', '789 Pine St.'),
(104,'David Wilson', 'david.wilson@example.com', '321 Elm St.'),
(105,'Eva Green', 'eva.green@example.com', '654 Cedar St.')

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[]

In [48]:
%%sql
INSERT INTO Products (product_id,name, price) VALUES
(201,'Laptop', 1200.00),
(202,'Smartphone', 800.00),
(203,'Tablet', 400.00),
(204,'Headphones', 150.00),
(205,'Smartwatch', 250.00);

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[]

In [49]:
%%sql
INSERT INTO sales (order_id,customer_id, product_id, sales_date, quantity, total) VALUES
(31,101, 201, '2024-01-15', 1, 1200.00),  -- Alice bought 1 Laptop
(32, 102, 202,'2024-01-16', 2, 1600.00),  -- Alice bought 2 Smartphones
(33, 102,201, '2024-01-17', 1, 1200.00),  -- Bob bought 1 Laptop
(34,102, 203, '2024-01-18', 3, 1200.00),  -- Bob bought 3 Tablets
(35, 103,202, '2024-01-19', 1, 800.00),   -- Charlie bought 1 Smartphone
(36, 103,204, '2024-01-20', 2, 300.00),   -- Charlie bought 2 Headphones
(37, 104,205, '2024-01-21', 1, 250.00),   -- David bought 1 Smartwatch
(38, 105,201, '2024-01-22', 1,1200.00);

 * mysql+pymysql://root:***@localhost:3306/
8 rows affected.

[]

In [50]:
%%sql
select * from customers;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(101, 'Alice Johnson', 'alice.johnson@example.com', '123 Maple St.'),
 (102, 'Bob Smith', 'bob.smith@example.com', '456 Oak St.'),
 (103, 'Charlie Brown', 'charlie.brown@example.com', '789 Pine St.'),
 (104, 'David Wilson', 'david.wilson@example.com', '321 Elm St.'),
 (105, 'Eva Green', 'eva.green@example.com', '654 Cedar St.')]

In [51]:
%%sql
select * from products;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(201, 'Laptop', Decimal('1200.00')),
 (202, 'Smartphone', Decimal('800.00')),
 (203, 'Tablet', Decimal('400.00')),
 (204, 'Headphones', Decimal('150.00')),
 (205, 'Smartwatch', Decimal('250.00'))]

In [53]:
%%sql
select * from sales;

 * mysql+pymysql://root:***@localhost:3306/
8 rows affected.

[(31, 101, 201, datetime.date(2024, 1, 15), 1, 1200),
 (32, 102, 202, datetime.date(2024, 1, 16), 2, 1600),
 (33, 102, 201, datetime.date(2024, 1, 17), 1, 1200),
 (34, 102, 203, datetime.date(2024, 1, 18), 3, 1200),
 (35, 103, 202, datetime.date(2024, 1, 19), 1, 800),
 (36, 103, 204, datetime.date(2024, 1, 20), 2, 300),
 (37, 104, 205, datetime.date(2024, 1, 21), 1, 250),
 (38, 105, 201, datetime.date(2024, 1, 22), 1, 1200)]

In [55]:
%%sql
# 1.
SELECT 
    p.name AS product,
    COUNT(*) AS tqty
FROM 
    sales s JOIN products p ON p.product_id = s.product_id
GROUP BY 
    product;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[('Laptop', 3),
 ('Smartphone', 2),
 ('Tablet', 1),
 ('Headphones', 1),
 ('Smartwatch', 1)]

In [57]:
%%sql
# 2.
SELECT
    c.name AS customer,
    SUM(s.total) AS tsales
FROM
    sales s JOIN customers c ON c.customer_id = s.customer_id
GROUP BY
    customer;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[('Alice Johnson', Decimal('1200')),
 ('Bob Smith', Decimal('4000')),
 ('Charlie Brown', Decimal('1100')),
 ('David Wilson', Decimal('250')),
 ('Eva Green', Decimal('1200'))]

In [72]:
%%sql
# 3.
SELECT
    c.name AS customer,
    c.email,
    c.address
FROM 
    customers c JOIN sales s ON c.customer_id = s.customer_id
# WHERE
#     s.quantity > 3
GROUP BY 
    c.name,c.email,c.address
HAVING
    SUM(s.quantity) > 3;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Bob Smith', 'bob.smith@example.com', '456 Oak St.')]

In [73]:
%%sql
# 4.
SELECT
    p.name AS product,
    s.sales_date
FROM
    sales s JOIN products p ON s.product_id = s.product_id
WHERE
    p.name like 'smartphone';

 * mysql+pymysql://root:***@localhost:3306/
8 rows affected.

[('Smartphone', datetime.date(2024, 1, 15)),
 ('Smartphone', datetime.date(2024, 1, 16)),
 ('Smartphone', datetime.date(2024, 1, 17)),
 ('Smartphone', datetime.date(2024, 1, 18)),
 ('Smartphone', datetime.date(2024, 1, 19)),
 ('Smartphone', datetime.date(2024, 1, 20)),
 ('Smartphone', datetime.date(2024, 1, 21)),
 ('Smartphone', datetime.date(2024, 1, 22))]

In [75]:
%%sql
# 5.
SELECT
    SUM(s.quantity) AS qty
FROM
    sales s JOIN products p ON p.product_id = s.product_id
WHERE
    p.price = 400
GROUP BY
    p.name;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(Decimal('3'),)]

In [77]:
%%sql
# 6.
SELECT 
    p.name AS product
FROM
    products p JOIN sales s ON p.product_id = s.product_id
ORDER BY
    s.quantity DESC
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Tablet',)]

In [76]:
%%sql
# 7.
SELECT 
    p.name AS product
FROM
    products p JOIN sales s ON p.product_id = s.product_id
GROUP BY
    product
ORDER BY
    SUM(s.quantity) DESC
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Laptop',)]

In [78]:
%%sql
# 8.
SELECT 
    c.name AS customer
FROM
    customers c JOIN sales s ON c.customer_id = s.customer_id
WHERE
    s.sales_date = '2024-01-19';

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Charlie Brown',)]

In [80]:
%%sql
# 9.
SELECT
    c.name AS customer,
    SUM(s.total) AS tsales
FROM
    sales s JOIN customers c ON c.customer_id = s.customer_id
WHERE
    s.quantity > 1
GROUP BY
    customer
HAVING
    tsales > 500;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Bob Smith', Decimal('2800'))]

In [86]:
%%sql
# 10.
SELECT
    SUM(s.quantity) AS tqty
FROM
    sales s JOIN customers c ON c.customer_id = s.customer_id
WHERE
    c.email LIKE "bob.smith@example.com"
GROUP BY
    c.email;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(Decimal('6'),)]

In [87]:
%%sql
# 11.
SELECT
    c.name AS customer,
    s.quantity
FROM
    sales s JOIN customers c ON c.customer_id = s.customer_id
WHERE
    c.name LIKE "c%";

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[('Charlie Brown', 1), ('Charlie Brown', 2)]

In [89]:
%%sql
# 12.
SELECT
    p.name AS product
FROM 
    productS p JOIN sales s ON p.product_id = s.product_id
WHERE
    s.total BETWEEN 150 AND 500;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[('Headphones',), ('Smartwatch',)]

In [4]:
%%sql
# 13.
SELECT
    c.name AS customer
FROM
    customers c JOIN sales s ON c.customer_id = s.customer_id
ORDER BY
    s.total DESC
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Bob Smith',)]

In [94]:
%%sql
# 14.
SELECT
    order_id
FROM
    SALES
WHERE
    quantity IN (1,2);

 * mysql+pymysql://root:***@localhost:3306/
7 rows affected.

[(31,), (32,), (33,), (35,), (36,), (37,), (38,)]

# Left Join

In [6]:
%%sql
SELECT
    p.name AS products,
    SUM(s.quantity) AS qty
FROM
    products p LEFT JOIN sales s ON p.product_id = s.product_id
GROUP BY
    products;

 * mysql+pymysql://root:***@localhost:3306/
6 rows affected.

[('Laptop', Decimal('3')),
 ('Smartphone', Decimal('3')),
 ('Tablet', Decimal('3')),
 ('Headphones', Decimal('2')),
 ('Smartwatch', Decimal('1')),
 ('pen', None)]

In [7]:
%%sql
SELECT
    p.name AS products,
    SUM(s.quantity) AS qty
FROM
    products p LEFT JOIN sales s ON p.product_id = s.product_id
GROUP BY
    products
HAVING 
    qty IS NULL;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('pen', None)]

In [8]:
%%sql
INSERT INTO course VALUES (6,"Data","Keerthana");
SELECT * FROM course;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
6 rows affected.

[(1, 'Computer Science', 'Dr. Smith'),
 (2, 'Mathematics', 'Prof. Johnson'),
 (3, 'Physics', 'Dr. Brown'),
 (4, 'Chemistry', 'Dr. White'),
 (5, 'Biology', 'Prof. Green'),
 (6, 'Data', 'Keerthana')]

In [9]:
%%sql
SELECT * FROM student;

 * mysql+pymysql://root:***@localhost:3306/
16 rows affected.

[(1, 'Alice', '123 Maple St.', 1, 20, Decimal('1500.00')),
 (2, 'Bob', '456 Oak St.', 2, 22, Decimal('1200.00')),
 (3, 'Charlie', '789 Pine St.', 3, 21, Decimal('1300.00')),
 (4, 'David', '321 Elm St.', 4, 23, Decimal('1400.00')),
 (5, 'Eva', '654 Cedar St.', 5, 19, Decimal('1100.00')),
 (6, 'Frank', '987 Birch St.', 1, 20, Decimal('1500.00')),
 (7, 'Grace', '135 Maple St.', 2, 22, Decimal('1200.00')),
 (8, 'Henry', '246 Oak St.', 3, 21, Decimal('1300.00')),
 (9, 'Irene', '369 Pine St.', 4, 23, Decimal('1400.00')),
 (10, 'Jack', '147 Elm St.', 5, 19, Decimal('1100.00')),
 (11, 'Alice', '123 Maple St.', 2, 20, Decimal('1500.00')),
 (12, 'Alice', '123 Maple St.', 3, 20, Decimal('1500.00')),
 (13, 'Bob', '456 Oak St.', 4, 22, Decimal('1200.00')),
 (14, 'Bob', '456 Oak St.', 5, 22, Decimal('1200.00')),
 (15, 'Charlie', '789 Pine St.', 4, 21, Decimal('1300.00')),
 (16, 'Charlie', '789 Pine St.', 5, 21, Decimal('1300.00'))]

1. How will you haddle null values in MYSQL
2. What is the Use of COALESCE
3. Use of IFNULL
4. Diff BW Left and Inner Join
5. Diff BW left and outter join
6. Trainner name who are assigned students
7. Trainer who are not assigned to any students
8. Trainer name who are assgined and not assinged any students

1. Handle NULL: Use functions like IS NULL, IFNULL(), or COALESCE() to manage missing values. 
2. COALESCE: Returns the first non-NULL value from a list. 
3. IFNULL: Replaces NULL with a value you choose. 
4. LEFT vs INNER JOIN: LEFT shows all left table rows; INNER shows only matched rows. 
5. LEFT vs OUTER JOIN: LEFT JOIN is a type of OUTER JOIN that only includes left-side unmatched rows.

In [4]:
%%sql
SELECT * FROM student;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
16 rows affected.

[(1, 'Alice', '123 Maple St.', 1, 20, Decimal('1500.00')),
 (2, 'Bob', '456 Oak St.', 2, 22, Decimal('1200.00')),
 (3, 'Charlie', '789 Pine St.', 3, 21, Decimal('1300.00')),
 (4, 'David', '321 Elm St.', 4, 23, Decimal('1400.00')),
 (5, 'Eva', '654 Cedar St.', 5, 19, Decimal('1100.00')),
 (6, 'Frank', '987 Birch St.', 1, 20, Decimal('1500.00')),
 (7, 'Grace', '135 Maple St.', 2, 22, Decimal('1200.00')),
 (8, 'Henry', '246 Oak St.', 3, 21, Decimal('1300.00')),
 (9, 'Irene', '369 Pine St.', 4, 23, Decimal('1400.00')),
 (10, 'Jack', '147 Elm St.', 5, 19, Decimal('1100.00')),
 (11, 'Alice', '123 Maple St.', 2, 20, Decimal('1500.00')),
 (12, 'Alice', '123 Maple St.', 3, 20, Decimal('1500.00')),
 (13, 'Bob', '456 Oak St.', 4, 22, Decimal('1200.00')),
 (14, 'Bob', '456 Oak St.', 5, 22, Decimal('1200.00')),
 (15, 'Charlie', '789 Pine St.', 4, 21, Decimal('1300.00')),
 (16, 'Charlie', '789 Pine St.', 5, 21, Decimal('1300.00'))]

In [5]:
%%sql
select * from course;

 * mysql+pymysql://root:***@localhost:3306/
6 rows affected.

[(1, 'Computer Science', 'Dr. Smith'),
 (2, 'Mathematics', 'Prof. Johnson'),
 (3, 'Physics', 'Dr. Brown'),
 (4, 'Chemistry', 'Dr. White'),
 (5, 'Biology', 'Prof. Green'),
 (6, 'Data', 'Keerthana')]

In [9]:
%%sql
SELECT 
    DISTINCT c.trainer
FROM
    course c LEFT JOIN student s ON c.course_id = s.course_id
WHERE
    s.name IS NOT NULL;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[('Dr. Smith',),
 ('Prof. Johnson',),
 ('Dr. Brown',),
 ('Dr. White',),
 ('Prof. Green',)]

In [10]:
%%sql
SELECT 
    DISTINCT c.trainer
FROM
    course c LEFT JOIN student s ON c.course_id = s.course_id
WHERE
    s.name IS NULL;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Keerthana',)]

In [12]:
%%sql
SELECT 
    DISTINCT c.trainer
FROM
    course c LEFT JOIN student s ON c.course_id = s.course_id;

 * mysql+pymysql://root:***@localhost:3306/
6 rows affected.

[('Dr. Smith',),
 ('Prof. Johnson',),
 ('Dr. Brown',),
 ('Dr. White',),
 ('Prof. Green',),
 ('Keerthana',)]

# Self Join

In [4]:
%%sql
USE lastcourse;
SELECT * FROM employees3;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
7 rows affected.

[(1, 'Alice Johnson', 'HR', Decimal('60000.00')),
 (2, 'Bob Smith', 'HR', Decimal('70000.00')),
 (3, 'Charlie Brown', 'IT', Decimal('80000.00')),
 (4, 'David Wilson', 'IT', Decimal('90000.00')),
 (5, 'Eva Green', 'Sales', Decimal('50000.00')),
 (6, 'Frank White', 'Sales', Decimal('50000.00')),
 (7, 'Grace Black', 'IT', Decimal('80000.00'))]

In [5]:
%%sql
create table referal(ID int primary key,NAME varchar(20) not null,REFERAL_ID int unique);
insert into referal values(1,"Bhuvanesh",null),(2,"Yuvasri",1),(3,"Kanika",2),(4,"John",3);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
4 rows affected.

[]

In [6]:
%%sql
SELECT * FROM referal;

 * mysql+pymysql://root:***@localhost:3306/
4 rows affected.

[(1, 'Bhuvanesh', None), (2, 'Yuvasri', 1), (3, 'Kanika', 2), (4, 'John', 3)]

In [8]:
%%sql
SELECT r.name,e.name
FROM referal r JOIN referal r ON e.id = r.referal_id;

 * mysql+pymysql://root:***@localhost:3306/
3 rows affected.

[('Yuvasri', 'Bhuvanesh'), ('Kanika', 'Yuvasri'), ('John', 'Kanika')]

In [12]:
%%sql
SELECT e.name AS name,r.name as referal
FROM referal e LEFT JOIN referal r ON e.referal_id = r.id 
WHERE r.name IS NULL;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Bhuvanesh', None)]

# Set operators

In [18]:
# Union
# union all
# intersect
# except

# Combines the result of multiple sql queries into single result set. same number of column and same datatype

# union removes dupicates
# union all - give all duplicates
# intersect - gives common records
# except or minus another softwere not common records and give record on left table

In [13]:
%%sql
create table first(name char(10) not null,age int not null,salary int);
create table second(name char(10) not null,age int not null,salary int);
create table three(name char(10) not null,age int not null,salary int);

insert into first values("Selva",26,23000),("Thowfeek",23,20000),("Janaki",24,24000);
insert into Second values("Haroon",24,16000),("Vidhya",22,15000),("Selva",26,23000),("Baskar",28,45000);
insert into Three values('Mani',22,17000),('Lavanya',23,18000),('Nitheesh',24,19000);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.
0 rows affected.
3 rows affected.
4 rows affected.
3 rows affected.

[]

In [19]:
%%sql
select * from first
union all
select * from second
union all
select * from three;

 * mysql+pymysql://root:***@localhost:3306/
10 rows affected.

[('Selva', 26, 23000),
 ('Thowfeek', 23, 20000),
 ('Janaki', 24, 24000),
 ('Haroon', 24, 16000),
 ('Vidhya', 22, 15000),
 ('Selva', 26, 23000),
 ('Baskar', 28, 45000),
 ('Mani', 22, 17000),
 ('Lavanya', 23, 18000),
 ('Nitheesh', 24, 19000)]

In [20]:
%%sql
select * from first
union
select * from second
union
select * from three;

 * mysql+pymysql://root:***@localhost:3306/
9 rows affected.

[('Selva', 26, 23000),
 ('Thowfeek', 23, 20000),
 ('Janaki', 24, 24000),
 ('Haroon', 24, 16000),
 ('Vidhya', 22, 15000),
 ('Baskar', 28, 45000),
 ('Mani', 22, 17000),
 ('Lavanya', 23, 18000),
 ('Nitheesh', 24, 19000)]

In [28]:
%%sql
select * from first
intersect
select * from second;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[('Selva', 26, 23000)]

In [27]:
%%sql
select * from first
intersect
select * from second
intersect
select * from three;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [26]:
%%sql
select * from first
except
select * from second;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[('Thowfeek', 23, 20000), ('Janaki', 24, 24000)]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql